CSI API ETABS v1

# cCaseResponseSpectrumGetDampType Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetDampType(
    	string Name,
    	ref int DampType
    )

    Function GetDampType (
    	Name As String,
    	ByRef DampType As Integer
    ) As Integer

    Dim instance As cCaseResponseSpectrum
    Dim Name As String
    Dim DampType As Integer
    Dim returnValue As Integer

    returnValue = instance.GetDampType(Name,
    	DampType)

    int GetDampType(
    	String^ Name,
    	int% DampType
    )

    abstract GetDampType :
            Name : string *
            DampType : int byref -> int

#### Parameters

Name

    Type: SystemString

DampType

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cCaseResponseSpectrum Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com